Radiative Heat Transfer/13Nov2023/grid_study/base_case/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

runApplication blockMesh

runApplication topoSet

runApplication createPatch -overwrite

runApplication $(getApplication)

#------------------------------------------------------------------------------
